{
    "categories": [
      {
        "name": "parcours et routage",
        "videos": [
          {
            "id":0,
            "description": "Explorez l'algorithme de parcours en largeur d'un arbre binaire dans cette vidéo concise. Apprenez comment cet algorithme explore chaque niveau de l'arbre avant de passer au suivant, offrant une méthode efficace pour naviguer à travers sa structure. Idéal pour les débutants et les experts en informatique à la recherche d'une compréhension claire de cet outil essentiel.",
            "sources": [
              "http://127.0.0.1:5500/videos/Algorithme de parcours en largeur dun arbre binaire.mp4"
            ],
            "subtitle": "Pierre",
            "miniature": "http://127.0.0.1:5500/miniatures/###########.png",
            "title": "Découvrez l'algorithme de parcours en largeur d'un arbre binaire"
          },
          {
            "id":3,
            "description": "Explorez l'algorithme de Dijkstra dans cette vidéo concise et instructive. Découvrez comment cet algorithme trouve le chemin le plus court dans un graphe pondéré à l'aide d'une approche méthodique et efficace. Parfait pour ceux qui cherchent à comprendre rapidement les principes fondamentaux de l'algorithme de Dijkstra et son application dans le domaine du routage et de l'optimisation de réseau.",
            "sources": [
              "http://127.0.0.1:5500/videos/############.mp4"
            ],
            "subtitle": "Pierre",
            "miniature": "http://127.0.0.1:5500/miniatures/############.png",
            "title": "Maîtrisez l'algorithme de Dijkstra en quelques minutes !"
          },
          {
            "id":6,
            "description": "Plongez dans le cœur du routage avec cet aperçu détaillé de l'algorithme de vecteur de distance RIP (Routing Information Protocol). Découvrez comment RIP fonctionne en calculant les meilleures routes vers les destinations en fonction des distances mesurées. Cette vidéo vous guidera à travers les étapes essentielles de l'algorithme, vous montrant comment les routeurs échangent des informations et mettent à jour leurs tables de routage en conséquence. Parfait pour ceux qui cherchent à comprendre les rouages internes des protocoles de routage et leur fonctionnement dans les réseaux informatiques.",
            "sources": [
              "http://127.0.0.1:5500/videos/############.mp4"
            ],
            "subtitle": "Pierre",
            "miniature": "http://127.0.0.1:5500/miniatures/############.png",
            "title": "Exploration de l'algorithme de vecteur de distance RIP"
          },
          {
            "id":2,
            "description": "Plongez dans le monde complexe des réseaux informatiques avec cette vidéo rapide et informative sur le protocole de routage OSPF (Open Shortest Path First). En moins de 7 minutes, vous découvrirez les principes fondamentaux de l'OSPF, comment il fonctionne pour acheminer les données à travers un réseau, et ses avantages par rapport à d'autres protocoles de routage. Parfait pour ceux qui cherchent à comprendre rapidement et efficacement les bases de l'OSPF.",
            "sources": [
              "http://127.0.0.1:5500/videos/############.mp4"
            ],
            "subtitle": "Pierre",
            "miniature": "http://127.0.0.1:5500/miniatures/############.png",
            "title": "Tout sur le protocole OSPF en moins de 7 minutes !"
          }
        ]
      },
      {
        "name": "tri et recherche",
        "videos": [
          {
            "id":5,
            "description": "Plongez-vous dans l'univers de l'algorithme de tri fusion avec cette vidéo captivante. Suivez pas à pas la trace d'exécution de la fusion de deux listes à travers la méthode Diviser pour Régner. Vous découvrirez comment ce processus divise les listes en sous-listes, les trie individuellement, puis les fusionne pour créer une liste triée finale. Idéal pour ceux qui cherchent à comprendre en détail le fonctionnement de cet algorithme de tri fondamental et son application pratique dans la résolution de problèmes de manière efficace.",
            "sources": [
              "http://127.0.0.1:5500/videos/############.mp4"
            ],
            "subtitle": "Pierre",
            "miniature": "http://127.0.0.1:5500/miniatures/############.png",
            "title": "Exploration de l'algorithme de tri fusion par la méthode Diviser pour Régner"
          },
          {
            "id":4,
            "description": "Explorez la stratégie algorithmique de Diviser pour Régner dans cette vidéo captivante. Découvrez comment cette approche divise un problème complexe en sous-problèmes plus simples, les résout individuellement, puis combine les solutions pour obtenir le résultat final. Parfait pour les passionnés d'informatique cherchant à comprendre comment cette technique est utilisée pour résoudre efficacement une variété de problèmes informatiques, des algorithmes de tri aux algorithmes de recherche et bien plus encore.",
            "sources": [
              "http://127.0.0.1:5500/videos/############.mp4"
            ],
            "subtitle": "Pierre",
            "miniature": "http://127.0.0.1:5500/miniatures/############.png",
            "title": "La puissance de Diviser pour Régner en informatique"
          }
        ]
      },
      {
        "name": "apprentissage automatique",
        "videos": [
          {
            "id":1,
            "description": "Plongez dans le monde du Machine Learning avec cette vidéo instructive sur l'algorithme KNN (K-Nearest Neighbors). Découvrez comment KNN fonctionne en classifiant les données en fonction de leurs voisins les plus proches, offrant ainsi une introduction claire à ce concept fondamental. Parfait pour les débutants cherchant à comprendre les bases du Machine Learning et ses applications pratiques.",
            "sources": [
              "http://127.0.0.1:5500/videos/########.mp4"
            ],
            "subtitle": "Pierre",
            "miniature": "http://127.0.0.1:5500/miniatures/.png",
            "title": "Démystification du Machine Learning : L'algorithme KNN"
          }
        ]
      }
    ]
  }
